report2/statistics.json
{
  "PUT update character" : {
    "transaction" : "PUT update character",
    "sampleCount" : 2000,
    "errorCount" : 2000,
    "errorPct" : 100.0,
    "meanResTime" : 5.149999999999998,
    "medianResTime" : 4.0,
    "minResTime" : 1.0,
    "maxResTime" : 67.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 9.0,
    "pct3ResTime" : 43.99000000000001,
    "throughput" : 447.8280340349306,
    "receivedKBytesPerSec" : 119.39165360501566,
    "sentKBytesPerSec" : 97.47738118562472
  },
  "GET character by id" : {
    "transaction" : "GET character by id",
    "sampleCount" : 2000,
    "errorCount" : 2000,
    "errorPct" : 100.0,
    "meanResTime" : 6.432000000000006,
    "medianResTime" : 5.0,
    "minResTime" : 0.0,
    "maxResTime" : 82.0,
    "pct1ResTime" : 10.0,
    "pct2ResTime" : 14.0,
    "pct3ResTime" : 34.99000000000001,
    "throughput" : 444.642063139173,
    "receivedKBytesPerSec" : 118.54226878612717,
    "sentKBytesPerSec" : 69.04110160071143
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 10000,
    "errorCount" : 6000,
    "errorPct" : 60.0,
    "meanResTime" : 210.39160000000004,
    "medianResTime" : 4.0,
    "minResTime" : 0.0,
    "maxResTime" : 3817.0,
    "pct1ResTime" : 129.79999999998108,
    "pct2ResTime" : 1934.7499999999945,
    "pct3ResTime" : 3396.99,
    "throughput" : 2120.890774125133,
    "receivedKBytesPerSec" : 18754.68832847296,
    "sentKBytesPerSec" : 390.534075092789
  },
  "DELETE character" : {
    "transaction" : "DELETE character",
    "sampleCount" : 2000,
    "errorCount" : 2000,
    "errorPct" : 100.0,
    "meanResTime" : 5.272500000000001,
    "medianResTime" : 4.0,
    "minResTime" : 0.0,
    "maxResTime" : 65.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 8.949999999999818,
    "pct3ResTime" : 47.0,
    "throughput" : 449.438202247191,
    "receivedKBytesPerSec" : 119.82092696629213,
    "sentKBytesPerSec" : 79.44171348314606
  },
  "POST create character" : {
    "transaction" : "POST create character",
    "sampleCount" : 2000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.274500000000005,
    "medianResTime" : 4.0,
    "minResTime" : 0.0,
    "maxResTime" : 83.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 10.0,
    "pct3ResTime" : 28.99000000000001,
    "throughput" : 446.12982377871964,
    "receivedKBytesPerSec" : 121.7450821157707,
    "sentKBytesPerSec" : 96.67140970053536
  },
  "GET all characters" : {
    "transaction" : "GET all characters",
    "sampleCount" : 2000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1029.8289999999986,
    "medianResTime" : 105.0,
    "minResTime" : 1.0,
    "maxResTime" : 3817.0,
    "pct1ResTime" : 3192.9,
    "pct2ResTime" : 3396.95,
    "pct3ResTime" : 3767.99,
    "throughput" : 424.44821731748726,
    "receivedKBytesPerSec" : 18311.324891898345,
    "sentKBytesPerSec" : 65.49103353140917
  }
}