report5/statistics.json
{
  "PUT update character" : {
    "transaction" : "PUT update character",
    "sampleCount" : 5257,
    "errorCount" : 5257,
    "errorPct" : 100.0,
    "meanResTime" : 337.380445120791,
    "medianResTime" : 318.0,
    "minResTime" : 33.0,
    "maxResTime" : 757.0,
    "pct1ResTime" : 541.1999999999998,
    "pct2ResTime" : 605.0,
    "pct3ResTime" : 689.0,
    "throughput" : 87.62835044672623,
    "receivedKBytesPerSec" : 23.36185514839479,
    "sentKBytesPerSec" : 19.073262502708694
  },
  "GET character by id" : {
    "transaction" : "GET character by id",
    "sampleCount" : 5765,
    "errorCount" : 5765,
    "errorPct" : 100.0,
    "meanResTime" : 4134.330789245447,
    "medianResTime" : 367.0,
    "minResTime" : 26.0,
    "maxResTime" : 108539.0,
    "pct1ResTime" : 648.0,
    "pct2ResTime" : 35586.7,
    "pct3ResTime" : 72049.24,
    "throughput" : 45.40943318945146,
    "receivedKBytesPerSec" : 12.721873436958473,
    "sentKBytesPerSec" : 6.997064620321214
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 31771,
    "errorCount" : 21223,
    "errorPct" : 66.79991,
    "meanResTime" : 14439.161090302458,
    "medianResTime" : 489.0,
    "minResTime" : 22.0,
    "maxResTime" : 135333.0,
    "pct1ResTime" : 87098.6,
    "pct2ResTime" : 133619.65,
    "pct3ResTime" : 135096.99,
    "throughput" : 227.56476832386667,
    "receivedKBytesPerSec" : 58854.30074731132,
    "sentKBytesPerSec" : 38.8742704162578
  },
  "DELETE character" : {
    "transaction" : "DELETE character",
    "sampleCount" : 5226,
    "errorCount" : 5226,
    "errorPct" : 100.0,
    "meanResTime" : 347.38212782242675,
    "medianResTime" : 330.5,
    "minResTime" : 27.0,
    "maxResTime" : 756.0,
    "pct1ResTime" : 549.0,
    "pct2ResTime" : 619.0,
    "pct3ResTime" : 695.7299999999996,
    "throughput" : 87.20755598571571,
    "receivedKBytesPerSec" : 23.249670687598037,
    "sentKBytesPerSec" : 15.414616829506391
  },
  "POST create character" : {
    "transaction" : "POST create character",
    "sampleCount" : 5340,
    "errorCount" : 36,
    "errorPct" : 0.6741573,
    "meanResTime" : 498.67640449438187,
    "medianResTime" : 327.0,
    "minResTime" : 22.0,
    "maxResTime" : 35600.0,
    "pct1ResTime" : 558.0,
    "pct2ResTime" : 630.9499999999998,
    "pct3ResTime" : 725.0,
    "throughput" : 72.33615995231773,
    "receivedKBytesPerSec" : 19.841487378423775,
    "sentKBytesPerSec" : 15.673681287421093
  },
  "GET all characters" : {
    "transaction" : "GET all characters",
    "sampleCount" : 10183,
    "errorCount" : 4939,
    "errorPct" : 48.502407,
    "meanResTime" : 42095.67023470492,
    "medianResTime" : 703.0,
    "minResTime" : 45.0,
    "maxResTime" : 135333.0,
    "pct1ResTime" : 133550.2,
    "pct2ResTime" : 134791.0,
    "pct3ResTime" : 135173.0,
    "throughput" : 72.93733391589609,
    "receivedKBytesPerSec" : 58812.22271285178,
    "sentKBytesPerSec" : 9.41167504100621
  }
}