report6/statistics.json
{
  "PUT update character" : {
    "transaction" : "PUT update character",
    "sampleCount" : 31452,
    "errorCount" : 31452,
    "errorPct" : 100.0,
    "meanResTime" : 2244.8292318453473,
    "medianResTime" : 1095.0,
    "minResTime" : 0.0,
    "maxResTime" : 135189.0,
    "pct1ResTime" : 2217.0,
    "pct2ResTime" : 5968.650000000063,
    "pct3ResTime" : 50395.97,
    "throughput" : 122.58690644621915,
    "receivedKBytesPerSec" : 232.2095059893732,
    "sentKBytesPerSec" : 7.743839285192287
  },
  "GET character by id" : {
    "transaction" : "GET character by id",
    "sampleCount" : 36500,
    "errorCount" : 36500,
    "errorPct" : 100.0,
    "meanResTime" : 6781.864821917818,
    "medianResTime" : 1170.0,
    "minResTime" : 1.0,
    "maxResTime" : 176119.0,
    "pct1ResTime" : 47141.90000000003,
    "pct2ResTime" : 59264.0,
    "pct3ResTime" : 135186.99,
    "throughput" : 141.02737476575933,
    "receivedKBytesPerSec" : 265.98816360141416,
    "sentKBytesPerSec" : 6.3473638264783725
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 170078,
    "errorCount" : 154709,
    "errorPct" : 90.963554,
    "meanResTime" : 10830.571037994145,
    "medianResTime" : 1222.0,
    "minResTime" : 0.0,
    "maxResTime" : 185054.0,
    "pct1ResTime" : 58384.0,
    "pct2ResTime" : 61125.95,
    "pct3ResTime" : 133629.82000000004,
    "throughput" : 645.2197862646389,
    "receivedKBytesPerSec" : 53467.909061198305,
    "sentKBytesPerSec" : 33.72662180572996
  },
  "DELETE character" : {
    "transaction" : "DELETE character",
    "sampleCount" : 30049,
    "errorCount" : 30049,
    "errorPct" : 100.0,
    "meanResTime" : 2397.602549169688,
    "medianResTime" : 1075.0,
    "minResTime" : 0.0,
    "maxResTime" : 135187.0,
    "pct1ResTime" : 2220.0,
    "pct2ResTime" : 7145.45000000011,
    "pct3ResTime" : 51723.990000000005,
    "throughput" : 114.39350390778168,
    "receivedKBytesPerSec" : 212.87531189803414,
    "sentKBytesPerSec" : 6.1516437118596325
  },
  "POST create character" : {
    "transaction" : "POST create character",
    "sampleCount" : 33468,
    "errorCount" : 25475,
    "errorPct" : 76.117485,
    "meanResTime" : 3471.247968208445,
    "medianResTime" : 1167.0,
    "minResTime" : 0.0,
    "maxResTime" : 136368.0,
    "pct1ResTime" : 4292.500000000007,
    "pct2ResTime" : 41230.350000000006,
    "pct3ResTime" : 60618.82000000003,
    "throughput" : 127.37874128429195,
    "receivedKBytesPerSec" : 241.3935133271359,
    "sentKBytesPerSec" : 8.032611621245394
  },
  "GET all characters" : {
    "transaction" : "GET all characters",
    "sampleCount" : 38609,
    "errorCount" : 31233,
    "errorPct" : 80.895645,
    "meanResTime" : 34594.99443134994,
    "medianResTime" : 1087.0,
    "minResTime" : 0.0,
    "maxResTime" : 185054.0,
    "pct1ResTime" : 5060.9000000000015,
    "pct2ResTime" : 25114.45000000024,
    "pct3ResTime" : 59523.780000000035,
    "throughput" : 157.4836230737227,
    "receivedKBytesPerSec" : 56477.83074224263,
    "sentKBytesPerSec" : 6.257796184257756
  }
}